Repository: MinTTu20/tkoaly-new-service
Catalog: tekis/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Board
fi: Hallitus

source: Boards
fi: Hallituksia

source: Board %(year)s
fi: Hallitus %(year)s

source: Chairman
fi: Puheenjohtaja

source: Treasurer
fi: Rahastonhoitaja

source: Secretary
fi: Sihteeri

source: Vice chairman
fi: Varapuheenjohtaja

source: Board Member
fi: Hallituksen jäsen

source: Study affairs
fi: Opintoasiat

source: Communications
fi: Tiedotus

source: Corporate affairs
fi: Yritysasiat

source: RV affairs
fi: RV-asiat

source: Freshman affairs
fi: Fuksiasiat

source: First deputy board member
fi: 1. varajäsen

source: Second deputy board member
fi: 2. varajäsen

source: Third deputy board member
fi: 3. varajäsen

source: Fourth deputy board member
fi: 4. varajäsen

source: Name
fi: Nimi

source: Mugshot
fi: Naama

source: Role
fi: Rooli

source: firstname.lastname(at)cs.helsinki.fi
fi: etunimi.sukunimi(at)cs.helsinki.fi

source: Contact
fi: Yhteystiedot

source: Board Members
fi: Hallituksen jäseniä

source: Past boards
fi: Aiemmat hallitukset

source: Officers %(year)s
fi: Virkailijat %(year)s

source: ^older/$
fi: ^aiemmat/$

source: Advanced options
fi: Lisäasetukset

source: Available languages
fi: Kielet

source: Flatpages
fi: Sisältösivuja

source: Page
fi: Sivu

source: Page with menu separator
fi: Sivu jolla on valikkoerotin

source: Direct Link
fi: Suora Linkki

source: Direct Link with menu separator
fi: Linkki jolla on valikkoerotin

source: Menu category
fi: Valikkokategoria

source: Menus are sorted ascending by this value. The first menu item in a category is the category link itself. <strong>Note:</strong> The first menu item in the top level category should be the front page.
fi: Valikot järjestetään nousevasti tämän arvon mukaan. Ensimmäinen sivu kategoriassa on kategorialinkki itse. <strong>Huom:</strong> Ylätason ensimmäinen sivu tulisi olla etusivu.

source: Menu index
fi: Valikkoindeksi

source: Flatpage type
fi: Sisältösivun tyyppi

source: Published pages show up on the menu. Unpublished pages can be reached over direct link.
fi: Julkaistut sivut näkyvät valikossa. Julkaisemattomia sivuja voi lukea suoralla linkillä.

source: Published
fi: Julkaistu

source: (no content yet)
fi: (ei sisältöä vielä)

source: Flatpage
fi: Sisältösivu

source: Language
fi: Kieli

source: The page is accessible on this path. Even external links have one.
fi: Sivun voi lukea tästä polusta. Myös linkeillä on sisäinen URL.

source: Title
fi: Otsikko

source: Menu Title
fi: Valikko-otsikko

source: Shorter title that fits in menu elements
fi: Lyhyempi otsikko joka mahtuu valikkoon

source: Content
fi: Sisältö

source: Body text for pages, URL for direct links
fi: Leipäteksti sivuille, kohde-URL linkeille

source: Content markup
fi: Sisällön merkintätapa

source: Local Flatpage
fi: Kotoistettu sisältösivu

source: Local Flatpages
fi: Kotoistettuja sisältösivuja

source: Title text
fi: Otsikkoteksti

source: Is active
fi: Aktiivinen

source: Sponsor
fi: Yhteistyökumppani

source: Sponsors
fi: Yhteistyökumppanit

source: Image
fi: Kuva

source: content image
fi: kuvituskuva

source: content images
fi: kuvituskuvia

source: Size
fi: Koko

source: File
fi: Tiedosto

source: download
fi: tiedosto

source: downloads
fi: tiedostoja

source: Nothing
fi: Ei mitään

source: Member officer
fi: Jäsenvirkailija

source: Member
fi: Jäsen

source: Officer
fi: Virkailija

source: Administrator
fi: Ylläpitäjä

source: Exam archive officer
fi: Tenttiarkistovirkailija

source: Non-member
fi: Ei-jäsen

source: Membership revoked
fi: Erotettu

source: External member
fi: Ulkojäsen

source: Sponsor member
fi: Tukijäsen

source: Honor member
fi: Kunniajäsen

source: Association
fi: Yhdistys

source: Activities
fi: Toiminta

source: (Top level)
fi: (Ylin taso)

source: Finnish
fi: Suomi

source: English
fi: Englanti

source: small
fi: pieni

source: banner
fi: banneri

source: Thumbnail Textiles
fi: Pikkukuva-Textilejä

source: Textile Snippet
fi: Textile-leike

source: Toggle navigation
fi: Vaihda navigointia

source: Options
fi: Valikko

source: Hello, <strong>%(name)s</strong>
fi: Hei, <strong>%(name)s</strong>

source: Site Admin
fi: Sivun ylläpito

source: Single Sign On
fi: Kirjautumispalvelu (SSO)

source: Log out
fi: Kirjaudu ulos

source: Not logged in
fi: Ei kirjautuneena

source: Member login
fi: Jäsenten kirjautuminen

source: Become a Member
fi: Liity jäseneksi

source: Select Language
fi: Valitse Kieli

source: Mail
fi: Posti

source: Company ID (Y-tunnus)
fi: Y-tunnus

source: E-mail
fi: Sähköposti

source: Phone to student room Gurula
fi: Puhelin opiskelijahuone Gurulaan

source: Bank Accounts
fi: Pankkitilit

source: Main Account
fi: Päätili

source: RV Account
fi: Ruokavälityksen tili

source: Content &copy; %(SITE_NAME)s and contributors.
fi: Sisältö &copy; %(SITE_NAME)s ja kirjoittajat

source: The website software is free software and <a href="%(source_link)s">is available on Github.</a> Feel free to fork it for your own association!
fi: Sivuston ohjelmisto on ilmaista avoimen lähdekoodin ohjelmistoa, joka <a href="%(source_link)s">on saatavilla Githubissa.</a> Muokkaa ihmeessä siitä kotisivu oman yhdistyksesi eduksi!

source: Main page
fi: Etusivu

source: Welcome
fi: Tervetuloa

source: OAuth Application: %(name)s
fi: OAuth-sovellus: %(name)s

source: If you lose the secret, please delete and recreate the app.
fi: Jos hukkaat salaisuuden, ole hyvä ja poista ja luo sovellus uudelleen.

source: Client ID:
fi: Asiakas-ID:

source: Client Secret:
fi: Asiakassalaisuus:

source: Client type:
fi: Asiakkaan tyyppi

source: Authorization Grant Type:
fi: Auktorisoinnin tyyppi

source: Go Back
fi: Takaisin

source: Edit
fi: Muokkaa

source: Delete
fi: Poista

source: Edit application %(name)s
fi: Muokkaa sovellusta %(name)s

source: Save
fi: Tallenna

source: The %(SITE_NAME)s single sign on service allows members to access association and affiliate services with a single login. You can manage your access or create your own services here.
fi: %(SITE_NAME)s SSO-palvelu tarjoaa jäsenille pääsyn yhdistyksen ja yhdistyksen kumppanien palveluihin yhden kirjautumisen takana. Voit hallita palveluiden pääsyä tietoihisi tai luoda uusia palveluita täällä.

source: Applications
fi: Sovellukset

source: Access Tokens
fi: Pääsyluvat

source: The %(SITE_NAME)s single sign on service allows members to access association and affiliate services with a single login. Members can manage their SSO access or create their own services here.
fi: %(SITE_NAME)s SSO-palvelu tarjoaa jäsenille pääsyn yhdistyksen ja yhdistyksen kumppanien palveluihin yhden kirjautumisen takana. Jäsenet voivat hallita palveluiden pääsyä tietoihinsa tai luoda uusia palveluita täällä.

source: You are currently not logged in as a member, but you can still browse the API reference below. Members can <a href="%(login_url)s">log in here</a>.
fi: Et ole tällä hetkellä kirjautuneena jäseneksi, mutta voit silti selata API-hakuteosta alla. Jäsenet voivat <a href="%(login_url)s">kirjautua tästä</a>.

source: API reference
fi: API-Hakuteos

source: SSO is implemented using OAuth2.
fi: SSO on toteutettu OAuth2:n avulla.

source: Check out OAuth tutorials, RFC, etc. for more details about OAuth 2 protocol views. <a href="%(tutorial_url)s">This one might be a decent tutorial</a>. You can fiddle with the API using <a href="%(consumer_url)s">this sample consumer app</a> and the endpoint URLs given below.
fi: Voit käyttää OAuth-ohjeita, RFC:tä, yms. OAuth-päätepisteiden tarkempien yksityiskohtien selvittämiseksi. Esim. <a href="%(tutorial_url)s">tässä voisi olla siedettävä ohje</a>. Voit myös tutkia APIa käyttämällä <a href="%(consumer_url)s">tätä testisovellusta</a> antaen sille alla listatut päätepiste-URLit.

source: Authorization code flow is supported. Supported scopes are <tt>read</tt> and <tt>write</tt>.
fi: Auktorisaatiokoodin flow (authorization code flow) on tuettu. Tuetut valtuudet ovat <tt>read</tt> (vain luku) ja <tt>write</tt> (vain kirjoitus).

source: You can also test your authentication code on a clone of this site. The link to this site's source code should be provided in the footer.
fi: Voit myös kokeilla autentikointikoodia tämän sivuston kloonia vasten. Linkki lähdekoodiin pitäisi olla sivun alareunassa.

source: To access authenticated APIs, a Bearer Token is supported.
fi: Autentikoituihin rajapintoihin pääsee käsiksi Bearer Tokenin avulla.

source: Asks the user to authorize the app
fi: Pyytää käyttäjää auktorisoimaan sovelluksen

source: Exchange grant for token
fi: Vaihda auktorisointi pääsylupaan (token)

source: Revoke a token
fi: Hylkää pääsylupa (token)

source: Exchange a token for user information as JSON.
fi: Vaihda pääsylupa käyttäjätietoihin JSON-muodossa

source: Logged out successfully. Thank you for spending time with us today!
fi: Kirjauduttu ulos onnistuneesti. Kiitos kun vietit aikaa kanssamme tänään!

source: Return to main page
fi: Palaa etusivulle

source: Not a member? <a href="%(register_link)s">Register as a new member</a>
fi: Etkö ole jäsen? <a href="%(register_link)s">Liity jäseneksi</a>

source: Log in
fi: Kirjaudu

source: Required
fi: Tärkeä kenttä

source: ^board/
fi: ^hallitus/

source: ^login/$
fi: ^kirjaudu/$

source: ^logout/$
fi: ^ulos/$
